[
  {
    "name": "Weather App",
    "description": "A weather application using React and Typescript with third party APIs: OpenWeatherData & Unsplash to display current and 5-day forecast weather for a user searched location!",
    "link": "https://weather-73c3e.web.app/",
    "repo": "https://github.com/ShinichiM/weather",
    "image": "/images/weather-project.jpg"
  },
  {
    "name": "Job Scraper - Indeed API",
    "description": "A custom API endpoint that scrapes Indeed.com with puppeteer.js and Typescript that is hosted via Google Cloud Functions through ScraperAPI proxy servers. The endpoint will scrape jobs input into the URL query parameters q and l (Job Title and Location)",
    "link": "https://us-central1-job-scraper-5b752.cloudfunctions.net/scrapeIndeed?q=Software%20Developer&l=Seattle,%20Washington",
    "repo": "https://github.com/ShinichiM/job-scraper/",
    "image": "/images/job-scraper.jpg"
  },
  {
    "name": "Food Festival",
    "description": "A single page application utilizing React and Typescript to display a landing page for a local food festival! The application contains information for event schedules and ticket purchasing. Currently does not allow users to purchase tickets, but displays popup modals for user experience. Come check out the Food Festival site!",
    "link": "https://festival-a346f.web.app/",
    "repo": "https://github.com/ShinichiM/festival/",
    "image": "/images/food-festival.jpg"
  },
  {
    "name": "Book Search",
    "description": "An application that utilizes the Google Book Search API to allow users to search for and save their favorite books! The application uses the standard MERN stack for dynamic page rendering to keep client side resources low and a mixture of MongoDB and GraphQL for more customizable querying and schema development. I also wanted to stay away from REST API as this can sometimes return uneeded or excess data. Some features I would like to implement in the upcoming future is to add E-commerce functionality such that users are able to also buy their books from this website.",
    "link": "https://book-search-82e85.web.app/",
    "repo": "https://github.com/ShinichiM/book-search-engine/",
    "image": "/images/book-search.jpg"
  },
  {
    "name": "Password Generator",
    "description": "A web application using JavaScript and HTML that generates a password based on user selection of password: length, special characters, upper and lower case characters, and numerical values.",
    "link": "https://shinichim.github.io/Password-Generator/",
    "repo": "https://github.com/ShinichiM/Password-Generator/",
    "image": "/images/password-generator.png"
  }
]
